Catalogs/ГрафикиИнвентаризацииМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГрафикиИнвентаризацииМагазинов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДниПоМестамВыкладкам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоВыкладки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаВыкладки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГрафикиИнвентаризацииМагазинов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Процедура ЗаполнитьДниНеделиВСтроках()
	
	Для Каждого СтрокаТаб Из Объект.ДниПоМестамВыкладкам Цикл
		ДниСтрока = "";
		Если Найти(СтрокаТаб.ДниНедели, "1") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Пн";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "2") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Вт";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "3") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Ср";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "4") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Чт";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "5") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Пт";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "6") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Сб";
		КонецЕсли;
		Если Найти(СтрокаТаб.ДниНедели, "7") Тогда
			ДниСтрока = ДниСтрока + ?(ЗначениеЗаполнено(ДниСтрока), ";", "") + "Вс";
		КонецЕсли;
		СтрокаТаб.ДниНеделиСтрока = ДниСтрока;
	КонецЦикла;		
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДниНеделиВСтроках();
	
КонецПроцедуры

&НаКлиенте
Процедура ДниПоМестамВыкладкамДниНеделиСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Результат = ОткрытьФормуМодально("Справочник.ГрафикиИнвентаризацииМагазинов.Форма.ФормаДнейНедели", Новый Структура("ДниСтрока", Элементы.ДниПоМестамВыкладкам.ТекущиеДанные.ДниНедели), ЭтаФорма);
	Если Результат <> Неопределено Тогда
		Элементы.ДниПоМестамВыкладкам.ТекущиеДанные.ДниНедели = Результат;
		ЗаполнитьДниНеделиВСтроках();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДниНеделиВСтроках();
	
КонецПроцедуры
